;***************************************************************
;* TMS320C2000 C/C++ Codegen                   PC v15.12.4.LTS *
;* Date/Time created: Wed Dec 04 08:39:45 2019                 *
;***************************************************************
	.compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --quiet --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=3 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../Source/data.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.4.LTS Copyright (c) 1996-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\ebenton\Documents\CERDEC TS\Firmware\CANbus\Debug")
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-$C$IR_1,16
	.field  	_INTERFACE+0,32
	.bits	$C$FSL1,32		; _INTERFACE[0] @ 0
	.bits	$C$FSL2,32		; _INTERFACE[1] @ 32
	.bits	$C$FSL3,32		; _INTERFACE[2] @ 64
	.bits	$C$FSL4,32		; _INTERFACE[3] @ 96
$C$IR_1:	.set	8

	.sect	".cinit"
	.align	1
	.field  	-$C$IR_2,16
	.field  	_METHOD+0,32
	.bits	$C$FSL5,32		; _METHOD[0] @ 0
	.bits	$C$FSL6,32		; _METHOD[1] @ 32
	.bits	$C$FSL7,32		; _METHOD[2] @ 64

        B         $C$L17,NEQ            ; [CPU_] |320| 
        ; branchcc occurs ; [] |320| 
	.dwpsn	file "../Source/data.c",line 326,column 5,is_stmt,isa 0
;----------------------------------------------------------------------
; 326 | addr = EXMEMSTART;                                                     
; 327 | for( l = 0; l < (EXMEMLENGTH/sizeof(adcwt_t)); l++ )                   
;----------------------------------------------------------------------
        MOVL      XAR1,#524288          ; [CPU_U] |326| 
        MOVL      XAR3,#65535           ; [CPU_U] 
$C$L18:    
	.dwpsn	file "../Source/data.c",line 329,column 7,is_stmt,isa 0
;----------------------------------------------------------------------
; 329 | if( memcmp( addr, (void*)&t, sizeof(adcwt_t) ) )                       
;----------------------------------------------------------------------
        MOVZ      AR5,SP                ; [CPU_] |329| 
        MOVL      XAR4,XAR1             ; [CPU_] |329| 
        MOVB      ACC,#16               ; [CPU_] |329| 
        SUBB      XAR5,#18              ; [CPU_U] |329| 
        MOVZ      AR5,AR5               ; [CPU_] |329| 
$C$DW$55	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$55, DW_AT_low_pc(0x00)
	.dwattr $C$DW$55, DW_AT_name("_memcmp")
	.dwattr $C$DW$55, DW_AT_TI_call

        LCR       #_memcmp              ; [CPU_] |329| 
        ; call occurs [#_memcmp] ; [] |329| 
        CMPB      AL,#0                 ; [CPU_] |329| 
        B         $C$L19,EQ             ; [CPU_] |329| 
        ; branchcc occurs ; [] |329| 
	.dwpsn	file "../Source/data.c",line 331,column 2,is_stmt,isa 0
;----------------------------------------------------------------------
; 331 | return addr;                                                           
;----------------------------------------------------------------------
        MOVL      XAR4,XAR1             ; [CPU_] |331| 
        B         $C$L20,UNC            ; [CPU_] |331| 
        ; branch occurs ; [] |331| 
$C$L19:    
	.dwpsn	file "../Source/data.c",line 327,column 17,is_stmt,isa 0
        MOVB      ACC,#0                ; [CPU_] |327| 
        SUBB      XAR3,#1               ; [CPU_] |327| 
	.dwpsn	file "../Source/data.c",line 333,column 7,is_stmt,isa 0
;----------------------------------------------------------------------
; 333 | addr = (void*)((Uint32)addr + sizeof(adcwt_t));                        
;----------------------------------------------------------------------
        ADDB      XAR1,#16              ; [CPU_] |333| 
	.dwpsn	file "../Source/data.c",line 327,column 17,is_stmt,isa 0
        SUBB      ACC,#1                ; [CPU_] |327| 
        CMPL      ACC,XAR3              ; [CPU_] |327| 
        B         $C$L18,NEQ            ; [CPU_] |327| 
        ; branchcc occurs ; [] |327| 
	.dwpsn	file "../Source/data.c",line 316,column 15,is_stmt,isa 0
        BANZ      $C$L16,AR2--          ; [CPU_] |316| 
        ; branchcc occurs ; [] |316| 
	.dwpsn	file "../Source/data.c",line 336,column 3,is_stmt,isa 0
;----------------------------------------------------------------------
; 336 | return 0;                                                              
;----------------------------------------------------------------------
        MOVB      XAR4,#0               ; [CPU_] |336| 
$C$L20:    
        SUBB      SP,#20                ; [CPU_U] 
	.dwcfi	cfa_offset, -8
        MOVL      XAR3,*--SP            ; [CPU_] 
	.dwcfi	cfa_offset, -6
	.dwcfi	restore_reg, 11
        MOVL      XAR2,*--SP            ; [CPU_] 
	.dwcfi	cfa_offset, -4
	.dwcfi	restore_reg, 9
        MOVL      XAR1,*--SP            ; [CPU_] 
	.dwcfi	cfa_offset, -2
	.dwcfi	restore_reg, 7
$C$DW$56	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$56, DW_AT_low_pc(0x00)
	.dwattr $C$DW$56, DW_AT_TI_return

        LRETR     ; [CPU_] 
        ; return occurs ; [] 
	.dwattr $C$DW$44, DW_AT_TI_end_file("../Source/data.c")
	.dwattr $C$DW$44, DW_AT_TI_end_line(0x151)
	.dwattr $C$DW$44, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$44

;***************************************************************
;* FAR STRINGS                                                 *
;***************************************************************
	.sect	".econst:.string"
	.align	2
$C$FSL1:	.string	"RS232",0
	.align	2
$C$FSL2:	.string	"RS485",0
	.align	2
$C$FSL3:	.string	"ETHERNET",0
	.align	2
$C$FSL4:	.string	"USB",0
	.align	2
$C$FSL5:	.string	"UNCAL",0
	.align	2
$C$FSL6:	.string	"MV/V ",0
	.align	2
$C$FSL7:	.string	"MASS ",0
	.align	2
$C$FSL8:	.string	"SHUNT",0
	.align	2
$C$FSL9:	.string	"LOAD",0
	.align	2
$C$FSL10:	.string	"PEAK",0
	.align	2
$C$FSL11:	.string	"VALL",0
	.align	2
$C$FSL12:	.string	"POS",0
	.align	2
$C$FSL13:	.string	"VEL",0
	.align	2
$C$FSL14:	.string	"LIMIT",0
	.align	2
$C$FSL15:	.string	"TEMP",0
	.align	2
$C$FSL16:	.string	"VOLT",0
	.align	2
$C$FSL17:	.string	"LB",0
	.align	2
$C$FSL18:	.string	"KG",0
	.align	2
$C$FSL19:	.string	"IN",0
	.align	2
$C$FSL20:	.string	"CM",0
	.align	2
$C$FSL21:	.string	"MM",0
	.align	2
$C$FSL22:	.string	"PS",0
	.align	2
$C$FSL23:	.string	"NM",0
	.align	2
$C$FSL24:	.string	"% ",0
	.align	2
$C$FSL25:	.string	"MV",0
	.align	2
$C$FSL26:	.string	"--",0
	.align	2
$C$FSL27:	.string	"Undefined",0
;**************************************************************
;* UNDEFINED EXTERNAL REFERENCES                              *
;**************************************************************
	.global	_memcmp
	.global	I$$TOFS
	.global	FS$$DIV
	.global	FS$$TOI
	.global	L$$DIV
	.global	FS$$ADD

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_name("ADC_WEIGHT")
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
$C$DW$57	.dwtag  DW_TAG_member
	.dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$57, DW_AT_name("adw")
	.dwattr $C$DW$57, DW_AT_TI_symbol_name("_adw")
	.dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$58	.dwtag  DW_TAG_member
	.dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$58, DW_AT_name("pos")
	.dwattr $C$DW$58, DW_AT_TI_symbol_name("_pos")
	.dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$59	.dwtag  DW_TAG_member
	.dwattr $C$DW$59, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$59, DW_AT_name("vel")
	.dwattr $C$DW$59, DW_AT_TI_symbol_name("_vel")
	.dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$21

$C$DW$T$51	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$51, DW_AT_name("adcwt_t")
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)

$C$DW$T$52	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$52, DW_AT_address_class(0x20)

$C$DW$60	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$60, DW_AT_type(*$C$DW$T$52)

$C$DW$T$54	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$60)


$C$DW$T$55	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x27100)
$C$DW$61	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$61, DW_AT_upper_bound(0x270f)

	.dwendtag $C$DW$T$55


$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_name("CHANNEL_CONF")
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x0a)
$C$DW$62	.dwtag  DW_TAG_member
	.dwattr $C$DW$62, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$62, DW_AT_name("ci")
	.dwattr $C$DW$62, DW_AT_TI_symbol_name("_ci")
	.dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$63	.dwtag  DW_TAG_member
	.dwattr $C$DW$63, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$63, DW_AT_name("bslope")
	.dwattr $C$DW$63, DW_AT_TI_symbol_name("_bslope")
	.dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$64	.dwtag  DW_TAG_member
	.dwattr $C$DW$64, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$64, DW_AT_name("tcx")
	.dwattr $C$DW$64, DW_AT_TI_symbol_name("_tcx")
	.dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$65	.dwtag  DW_TAG_member
	.dwattr $C$DW$65, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$65, DW_AT_name("tcy")
	.dwattr $C$DW$65, DW_AT_TI_symbol_name("_tcy")
	.dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$66	.dwtag  DW_TAG_member
	.dwattr $C$DW$66, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$66, DW_AT_name("tcz")
	.dwattr $C$DW$66, DW_AT_TI_symbol_name("_tcz")
	.dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$22

$C$DW$T$30	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$30, DW_AT_name("cconf_t")
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)


$C$DW$T$31	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x28)
$C$DW$67	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$67, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$31


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_name("DAC_CONF")
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
$C$DW$68	.dwtag  DW_TAG_member
	.dwattr $C$DW$68, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$68, DW_AT_name("what")
	.dwattr $C$DW$68, DW_AT_TI_symbol_name("_what")
	.dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$69	.dwtag  DW_TAG_member
	.dwattr $C$DW$69, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$69, DW_AT_name("ch")
	.dwattr $C$DW$69, DW_AT_TI_symbol_name("_ch")
	.dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$70	.dwtag  DW_TAG_member
	.dwattr $C$DW$70, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$70, DW_AT_name("dslopep")
	.dwattr $C$DW$70, DW_AT_TI_symbol_name("_dslopep")
	.dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$71	.dwtag  DW_TAG_member
	.dwattr $C$DW$71, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$71, DW_AT_name("dslopen")
	.dwattr $C$DW$71, DW_AT_TI_symbol_name("_dslopen")
	.dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$72	.dwtag  DW_TAG_member
	.dwattr $C$DW$72, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$72, DW_AT_name("dint")
	.dwattr $C$DW$72, DW_AT_TI_symbol_name("_dint")
	.dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$73	.dwtag  DW_TAG_member
	.dwattr $C$DW$73, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$73, DW_AT_name("gain")
	.dwattr $C$DW$73, DW_AT_TI_symbol_name("_gain")
	.dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$74	.dwtag  DW_TAG_member
	.dwattr $C$DW$74, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$74, DW_AT_name("offset")
	.dwattr $C$DW$74, DW_AT_TI_symbol_name("_offset")
	.dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$24

$C$DW$T$36	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$36, DW_AT_name("dacconf_t")
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)


$C$DW$T$37	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x30)
$C$DW$75	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$75, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$37


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_name("DISPLAY_CONF")
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
$C$DW$76	.dwtag  DW_TAG_member
	.dwattr $C$DW$76, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$76, DW_AT_name("what")
	.dwattr $C$DW$76, DW_AT_TI_symbol_name("_what")
	.dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$77	.dwtag  DW_TAG_member
	.dwattr $C$DW$77, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$77, DW_AT_name("ch")
	.dwattr $C$DW$77, DW_AT_TI_symbol_name("_ch")
	.dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$78	.dwtag  DW_TAG_member
	.dwattr $C$DW$78, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$78, DW_AT_name("adec")
	.dwattr $C$DW$78, DW_AT_TI_symbol_name("_adec")
	.dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$25

$C$DW$T$34	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$34, DW_AT_name("dconf_t")
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)


$C$DW$T$35	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
$C$DW$79	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$79, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$35


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_name("LIM_CONF")
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
$C$DW$80	.dwtag  DW_TAG_member
	.dwattr $C$DW$80, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$80, DW_AT_name("what")
	.dwattr $C$DW$80, DW_AT_TI_symbol_name("_what")
	.dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$81	.dwtag  DW_TAG_member
	.dwattr $C$DW$81, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$81, DW_AT_name("ch")
	.dwattr $C$DW$81, DW_AT_TI_symbol_name("_ch")
	.dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$82	.dwtag  DW_TAG_member
	.dwattr $C$DW$82, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$82, DW_AT_name("limit")
	.dwattr $C$DW$82, DW_AT_TI_symbol_name("_limit")
	.dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$83	.dwtag  DW_TAG_member
	.dwattr $C$DW$83, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$83, DW_AT_name("limits")
	.dwattr $C$DW$83, DW_AT_TI_symbol_name("_limits")
	.dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$84	.dwtag  DW_TAG_member
	.dwattr $C$DW$84, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$84, DW_AT_name("limitr")
	.dwattr $C$DW$84, DW_AT_TI_symbol_name("_limitr")
	.dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$26

$C$DW$T$38	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$38, DW_AT_name("limconf_t")
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)


$C$DW$T$39	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x20)
$C$DW$85	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$85, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$39


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_name("PROD_CONF")
	.dwattr $C$DW$T$41, DW_AT_byte_size(0xc96)
$C$DW$86	.dwtag  DW_TAG_member
	.dwattr $C$DW$86, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$86, DW_AT_name("usn")
	.dwattr $C$DW$86, DW_AT_TI_symbol_name("_usn")
	.dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$87	.dwtag  DW_TAG_member
	.dwattr $C$DW$87, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$87, DW_AT_name("uname")
	.dwattr $C$DW$87, DW_AT_TI_symbol_name("_uname")
	.dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$88	.dwtag  DW_TAG_member
	.dwattr $C$DW$88, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$88, DW_AT_name("rxdir")
	.dwattr $C$DW$88, DW_AT_TI_symbol_name("_rxdir")
	.dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$89	.dwtag  DW_TAG_member
	.dwattr $C$DW$89, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$89, DW_AT_name("baud")
	.dwattr $C$DW$89, DW_AT_TI_symbol_name("_baud")
	.dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$90	.dwtag  DW_TAG_member
	.dwattr $C$DW$90, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$90, DW_AT_name("tagiden")
	.dwattr $C$DW$90, DW_AT_TI_symbol_name("_tagiden")
	.dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$91	.dwtag  DW_TAG_member
	.dwattr $C$DW$91, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$91, DW_AT_name("tarepersist")
	.dwattr $C$DW$91, DW_AT_TI_symbol_name("_tarepersist")
	.dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$92	.dwtag  DW_TAG_member
	.dwattr $C$DW$92, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$92, DW_AT_name("filter")
	.dwattr $C$DW$92, DW_AT_TI_symbol_name("_filter")
	.dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$93	.dwtag  DW_TAG_member
	.dwattr $C$DW$93, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$93, DW_AT_name("diffwin")
	.dwattr $C$DW$93, DW_AT_TI_symbol_name("_diffwin")
	.dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$94	.dwtag  DW_TAG_member
	.dwattr $C$DW$94, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$94, DW_AT_name("ch")
	.dwattr $C$DW$94, DW_AT_TI_symbol_name("_ch")
	.dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$95	.dwtag  DW_TAG_member
	.dwattr $C$DW$95, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$95, DW_AT_name("sensor")
	.dwattr $C$DW$95, DW_AT_TI_symbol_name("_sensor")
	.dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$96	.dwtag  DW_TAG_member
	.dwattr $C$DW$96, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$96, DW_AT_name("vfd")
	.dwattr $C$DW$96, DW_AT_TI_symbol_name("_vfd")
	.dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xc32]
	.dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$97	.dwtag  DW_TAG_member
	.dwattr $C$DW$97, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$97, DW_AT_name("dac")
	.dwattr $C$DW$97, DW_AT_TI_symbol_name("_dac")
	.dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0xc3e]
	.dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$98	.dwtag  DW_TAG_member
	.dwattr $C$DW$98, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$98, DW_AT_name("lim")
	.dwattr $C$DW$98, DW_AT_TI_symbol_name("_lim")
	.dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6e]
	.dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$99	.dwtag  DW_TAG_member
	.dwattr $C$DW$99, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$99, DW_AT_name("velfilter")
	.dwattr $C$DW$99, DW_AT_TI_symbol_name("_velfilter")
	.dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8e]
	.dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$100	.dwtag  DW_TAG_member
	.dwattr $C$DW$100, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$100, DW_AT_name("cntperin")
	.dwattr $C$DW$100, DW_AT_TI_symbol_name("_cntperin")
	.dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0xc90]
	.dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$101	.dwtag  DW_TAG_member
	.dwattr $C$DW$101, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$101, DW_AT_name("magic")
	.dwattr $C$DW$101, DW_AT_TI_symbol_name("_magic")
	.dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0xc94]
	.dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$41

$C$DW$T$58	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$58, DW_AT_name("pconf_t")
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)

$C$DW$102	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$102, DW_AT_type(*$C$DW$T$58)

$C$DW$T$59	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$102)


$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_name("SENSOR_CONF")
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x98)
$C$DW$103	.dwtag  DW_TAG_member
	.dwattr $C$DW$103, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$103, DW_AT_name("ssn")
	.dwattr $C$DW$103, DW_AT_TI_symbol_name("_ssn")
	.dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$104	.dwtag  DW_TAG_member
	.dwattr $C$DW$104, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$104, DW_AT_name("slbl")
	.dwattr $C$DW$104, DW_AT_TI_symbol_name("_slbl")
	.dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$105	.dwtag  DW_TAG_member
	.dwattr $C$DW$105, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$105, DW_AT_name("tagid")
	.dwattr $C$DW$105, DW_AT_TI_symbol_name("_tagid")
	.dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$106	.dwtag  DW_TAG_member
	.dwattr $C$DW$106, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$106, DW_AT_name("method")
	.dwattr $C$DW$106, DW_AT_TI_symbol_name("_method")
	.dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$107	.dwtag  DW_TAG_member
	.dwattr $C$DW$107, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$107, DW_AT_name("date")
	.dwattr $C$DW$107, DW_AT_TI_symbol_name("_date")
	.dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$108	.dwtag  DW_TAG_member
	.dwattr $C$DW$108, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$108, DW_AT_name("range")
	.dwattr $C$DW$108, DW_AT_TI_symbol_name("_range")
	.dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$109	.dwtag  DW_TAG_member
	.dwattr $C$DW$109, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$109, DW_AT_name("unit")
	.dwattr $C$DW$109, DW_AT_TI_symbol_name("_unit")
	.dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$110	.dwtag  DW_TAG_member
	.dwattr $C$DW$110, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$110, DW_AT_name("ounit")
	.dwattr $C$DW$110, DW_AT_TI_symbol_name("_ounit")
	.dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$111	.dwtag  DW_TAG_member
	.dwattr $C$DW$111, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$111, DW_AT_name("ufactor")
	.dwattr $C$DW$111, DW_AT_TI_symbol_name("_ufactor")
	.dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$112	.dwtag  DW_TAG_member
	.dwattr $C$DW$112, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$112, DW_AT_name("points")
	.dwattr $C$DW$112, DW_AT_TI_symbol_name("_points")
	.dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$113	.dwtag  DW_TAG_member
	.dwattr $C$DW$113, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$113, DW_AT_name("mass")
	.dwattr $C$DW$113, DW_AT_TI_symbol_name("_mass")
	.dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$114	.dwtag  DW_TAG_member
	.dwattr $C$DW$114, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$114, DW_AT_name("adc")
	.dwattr $C$DW$114, DW_AT_TI_symbol_name("_adc")
	.dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$115	.dwtag  DW_TAG_member
	.dwattr $C$DW$115, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$115, DW_AT_name("slope")
	.dwattr $C$DW$115, DW_AT_TI_symbol_name("_slope")
	.dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$116	.dwtag  DW_TAG_member
	.dwattr $C$DW$116, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$116, DW_AT_name("intercept")
	.dwattr $C$DW$116, DW_AT_TI_symbol_name("_intercept")
	.dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
	.dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$117	.dwtag  DW_TAG_member
	.dwattr $C$DW$117, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$117, DW_AT_name("shunt")
	.dwattr $C$DW$117, DW_AT_TI_symbol_name("_shunt")
	.dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$118	.dwtag  DW_TAG_member
	.dwattr $C$DW$118, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$118, DW_AT_name("base")
	.dwattr $C$DW$118, DW_AT_TI_symbol_name("_base")
	.dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
	.dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$119	.dwtag  DW_TAG_member
	.dwattr $C$DW$119, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$119, DW_AT_name("tare")
	.dwattr $C$DW$119, DW_AT_TI_symbol_name("_tare")
	.dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$120	.dwtag  DW_TAG_member
	.dwattr $C$DW$120, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$120, DW_AT_name("dacgain")
	.dwattr $C$DW$120, DW_AT_TI_symbol_name("_dacgain")
	.dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
	.dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$121	.dwtag  DW_TAG_member
	.dwattr $C$DW$121, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$121, DW_AT_name("dacoff")
	.dwattr $C$DW$121, DW_AT_TI_symbol_name("_dacoff")
	.dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
	.dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$122	.dwtag  DW_TAG_member
	.dwattr $C$DW$122, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$122, DW_AT_name("ch")
	.dwattr $C$DW$122, DW_AT_TI_symbol_name("_ch")
	.dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
	.dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$46

$C$DW$T$32	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$32, DW_AT_name("sconf_t")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)


$C$DW$T$33	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$33, DW_AT_byte_size(0xbe0)
$C$DW$123	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$123, DW_AT_upper_bound(0x13)

	.dwendtag $C$DW$T$33

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)

$C$DW$124	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$124, DW_AT_type(*$C$DW$T$2)

$C$DW$T$62	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$124)

$C$DW$T$63	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$63, DW_AT_address_class(0x20)

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)

$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)

$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)

$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)

$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)

$C$DW$T$23	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$23, DW_AT_name("Uint16")
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)

$C$DW$125	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$125, DW_AT_type(*$C$DW$T$23)

$C$DW$T$74	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$125)


$C$DW$T$75	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
$C$DW$126	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$126, DW_AT_upper_bound(0x07)

	.dwendtag $C$DW$T$75

$C$DW$127	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$127, DW_AT_type(*$C$DW$T$23)

$C$DW$T$76	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$127)

$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x02)


$C$DW$T$40	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
$C$DW$128	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$128, DW_AT_upper_bound(0x01)

	.dwendtag $C$DW$T$40


$C$DW$T$44	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x18)
$C$DW$129	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$129, DW_AT_upper_bound(0x0b)

