;***************************************************************
;* TMS320C2000 C/C++ Codegen                   PC v15.12.4.LTS *
;* Date/Time created: Thu Dec 19 12:23:44 2019                 *
;***************************************************************
	.compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --quiet --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=3 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../DSP281x_common/source/DSP281x_PieVect.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.4.LTS Copyright (c) 1996-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\ebenton\Documents\CERDEC TS\Firmware\CANbus\Debug")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("T3CINT_ISR")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_T3CINT_ISR")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwendtag $C$DW$1


$C$DW$2	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$2, DW_AT_name("T3UFINT_ISR")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("_T3UFINT_ISR")
	.dwattr $C$DW$2, DW_AT_declaration
	.dwattr $C$DW$2, DW_AT_external
	.dwendtag $C$DW$2


$C$DW$3	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$3, DW_AT_name("CMP6INT_ISR")
	.dwattr $C$DW$3, DW_AT_TI_symbol_name("_CMP6INT_ISR")
	.dwattr $C$DW$3, DW_AT_declaration

; 186 | int16   i;                                                             
;----------------------------------------------------------------------

;***************************************************************
;* FNAME: _InitPieVectTable             FR SIZE:   0           *
;*                                                             *
;* FUNCTION ENVIRONMENT                                        *
;*                                                             *
;* FUNCTION PROPERTIES                                         *
;*                            0 Parameter,  0 Auto,  0 SOE     *
;***************************************************************

_InitPieVectTable:
;* AR5   assigned to _Source
$C$DW$71	.dwtag  DW_TAG_variable
	.dwattr $C$DW$71, DW_AT_name("Source")
	.dwattr $C$DW$71, DW_AT_TI_symbol_name("_Source")
	.dwattr $C$DW$71, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$71, DW_AT_location[DW_OP_reg14]

;* AR4   assigned to _Dest
$C$DW$72	.dwtag  DW_TAG_variable
	.dwattr $C$DW$72, DW_AT_name("Dest")
	.dwattr $C$DW$72, DW_AT_TI_symbol_name("_Dest")
	.dwattr $C$DW$72, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$72, DW_AT_location[DW_OP_reg12]

	.dwcfi	cfa_offset, -2
	.dwcfi	save_reg_to_mem, 26, 0
 EALLOW
	.dwpsn	file "../DSP281x_common/source/DSP281x_PieVect.c",line 187,column 17,is_stmt,isa 0
;----------------------------------------------------------------------
; 187 | Uint32 *Source = (void *) &PieVectTableInit;                           
;----------------------------------------------------------------------
        MOVL      XAR5,#_PieVectTableInit ; [CPU_U] |187| 
	.dwpsn	file "../DSP281x_common/source/DSP281x_PieVect.c",line 188,column 15,is_stmt,isa 0
;----------------------------------------------------------------------
; 188 | Uint32 *Dest = (void *) &PieVectTable;                                 
; 190 | EALLOW;                                                                
; 191 | for(i=0; i < 128; i++)                                                 
;----------------------------------------------------------------------
        MOVL      XAR4,#_PieVectTable   ; [CPU_U] |188| 
        MOVB      XAR6,#127             ; [CPU_] 
$C$L1:    
	.dwpsn	file "../DSP281x_common/source/DSP281x_PieVect.c",line 192,column 3,is_stmt,isa 0
;----------------------------------------------------------------------
; 192 | *Dest++ = *Source++;                                                   
; 193 | EDIS;                                                                  
; 195 | // Enable the PIE Vector Table                                         
;----------------------------------------------------------------------
        MOVL      ACC,*XAR5++           ; [CPU_] |192| 
        MOVL      *XAR4++,ACC           ; [CPU_] |192| 
	.dwpsn	file "../DSP281x_common/source/DSP281x_PieVect.c",line 191,column 11,is_stmt,isa 0
        BANZ      $C$L1,AR6--           ; [CPU_] |191| 
        ; branchcc occurs ; [] |191| 
 EDIS
        SPM       #0                    ; [CPU_] 
        MOVW      DP,#_PieCtrlRegs      ; [CPU_U] 
	.dwpsn	file "../DSP281x_common/source/DSP281x_PieVect.c",line 196,column 2,is_stmt,isa 0
;----------------------------------------------------------------------
; 196 | PieCtrlRegs.PIECRTL.bit.ENPIE = 1;                                     
;----------------------------------------------------------------------
        OR        @_PieCtrlRegs,#0x0001 ; [CPU_] |196| 
$C$DW$73	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$73, DW_AT_low_pc(0x00)
	.dwattr $C$DW$73, DW_AT_TI_return

        LRETR     ; [CPU_] 
        ; return occurs ; [] 
	.dwattr $C$DW$70, DW_AT_TI_end_file("../DSP281x_common/source/DSP281x_PieVect.c")
	.dwattr $C$DW$70, DW_AT_TI_end_line(0xc6)
	.dwattr $C$DW$70, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$70

;**************************************************************
;* UNDEFINED EXTERNAL REFERENCES                              *
;**************************************************************
	.global	_T3CINT_ISR
	.global	_T3UFINT_ISR
	.global	_CMP6INT_ISR
	.global	_T3PINT_ISR
	.global	_T4CINT_ISR
	.global	_T4UFINT_ISR
	.global	_T3OFINT_ISR
	.global	_T4PINT_ISR
	.global	_T2OFINT_ISR
	.global	_CAPINT1_ISR
	.global	_T2CINT_ISR
	.global	_T2UFINT_ISR
	.global	_CMP4INT_ISR
	.global	_CMP5INT_ISR
	.global	_CAPINT2_ISR
	.global	_CAPINT3_ISR
	.global	_T2PINT_ISR
	.global	_SCITXINTB_ISR
	.global	_ECAN0INTA_ISR
	.global	_SCITXINTA_ISR
	.global	_SCIRXINTB_ISR
	.global	_rsvd_ISR
	.global	_ECAN1INTA_ISR
	.global	_PIE_RESERVED
	.global	_CAPINT6_ISR
	.global	_SPIRXINTA_ISR
	.global	_CAPINT4_ISR
	.global	_CAPINT5_ISR
	.global	_MXINTA_ISR
	.global	_SCIRXINTA_ISR
	.global	_SPITXINTA_ISR
	.global	_MRINTA_ISR
	.global	_USER5_ISR
	.global	_USER6_ISR
	.global	_USER3_ISR
	.global	_USER4_ISR
	.global	_USER9_ISR
	.global	_USER10_ISR
	.global	_USER7_ISR
	.global	_USER8_ISR
	.global	_RTOSINT_ISR
	.global	_EMUINT_ISR
	.global	_INT14_ISR
	.global	_DATALOG_ISR
	.global	_USER1_ISR
	.global	_USER2_ISR
	.global	_NMI_ISR
	.global	_ILLEGAL_ISR
	.global	_INT13_ISR
	.global	_CMP3INT_ISR
	.global	_T1PINT_ISR
	.global	_CMP1INT_ISR
	.global	_CMP2INT_ISR
	.global	_T1OFINT_ISR
	.global	_T4OFINT_ISR
	.global	_T1CINT_ISR
	.global	_T1UFINT_ISR
	.global	_PDPINTB_ISR
	.global	_XINT1_ISR
	.global	_USER12_ISR
	.global	_PDPINTA_ISR
	.global	_TINT0_ISR
	.global	_WAKEINT_ISR
	.global	_XINT2_ISR
	.global	_ADCINT_ISR
	.global	_USER11_ISR
	.global	_PieCtrlRegs
	.global	_PieVectTable

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
$C$DW$74	.dwtag  DW_TAG_member
	.dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$74, DW_AT_name("ACK1")
	.dwattr $C$DW$74, DW_AT_TI_symbol_name("_ACK1")
	.dwattr $C$DW$74, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$74, DW_AT_bit_size(0x01)
	.dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$75	.dwtag  DW_TAG_member
	.dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$75, DW_AT_name("ACK2")
	.dwattr $C$DW$75, DW_AT_TI_symbol_name("_ACK2")
	.dwattr $C$DW$75, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$75, DW_AT_bit_size(0x01)
	.dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$76	.dwtag  DW_TAG_member
	.dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$76, DW_AT_name("ACK3")
	.dwattr $C$DW$76, DW_AT_TI_symbol_name("_ACK3")
	.dwattr $C$DW$76, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$76, DW_AT_bit_size(0x01)
	.dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$77	.dwtag  DW_TAG_member
	.dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$77, DW_AT_name("ACK4")
	.dwattr $C$DW$77, DW_AT_TI_symbol_name("_ACK4")
	.dwattr $C$DW$77, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$77, DW_AT_bit_size(0x01)
	.dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$78	.dwtag  DW_TAG_member
	.dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$78, DW_AT_name("ACK5")
	.dwattr $C$DW$78, DW_AT_TI_symbol_name("_ACK5")
	.dwattr $C$DW$78, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$78, DW_AT_bit_size(0x01)
	.dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$79	.dwtag  DW_TAG_member
	.dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$79, DW_AT_name("ACK6")
	.dwattr $C$DW$79, DW_AT_TI_symbol_name("_ACK6")
	.dwattr $C$DW$79, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$79, DW_AT_bit_size(0x01)
	.dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$80	.dwtag  DW_TAG_member
	.dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$80, DW_AT_name("ACK7")
	.dwattr $C$DW$80, DW_AT_TI_symbol_name("_ACK7")
	.dwattr $C$DW$80, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$80, DW_AT_bit_size(0x01)
	.dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$81	.dwtag  DW_TAG_member
	.dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$81, DW_AT_name("ACK8")
	.dwattr $C$DW$81, DW_AT_TI_symbol_name("_ACK8")
	.dwattr $C$DW$81, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$81, DW_AT_bit_size(0x01)
	.dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$82	.dwtag  DW_TAG_member
	.dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$82, DW_AT_name("ACK9")
	.dwattr $C$DW$82, DW_AT_TI_symbol_name("_ACK9")
	.dwattr $C$DW$82, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$82, DW_AT_bit_size(0x01)
	.dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$83	.dwtag  DW_TAG_member
	.dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$83, DW_AT_name("ACK10")
	.dwattr $C$DW$83, DW_AT_TI_symbol_name("_ACK10")
	.dwattr $C$DW$83, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$83, DW_AT_bit_size(0x01)
	.dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$84	.dwtag  DW_TAG_member
	.dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$84, DW_AT_name("ACK11")
	.dwattr $C$DW$84, DW_AT_TI_symbol_name("_ACK11")
	.dwattr $C$DW$84, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$84, DW_AT_bit_size(0x01)
	.dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$85	.dwtag  DW_TAG_member
	.dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$85, DW_AT_name("ACK12")
	.dwattr $C$DW$85, DW_AT_TI_symbol_name("_ACK12")
	.dwattr $C$DW$85, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$85, DW_AT_bit_size(0x01)
	.dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$86	.dwtag  DW_TAG_member
	.dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$86, DW_AT_name("rsvd")
	.dwattr $C$DW$86, DW_AT_TI_symbol_name("_rsvd")
	.dwattr $C$DW$86, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$86, DW_AT_bit_size(0x04)
	.dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$20


$C$DW$T$21	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
$C$DW$87	.dwtag  DW_TAG_member
	.dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$87, DW_AT_name("all")
	.dwattr $C$DW$87, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$88	.dwtag  DW_TAG_member
	.dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$88, DW_AT_name("bit")
	.dwattr $C$DW$88, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$21


$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
$C$DW$89	.dwtag  DW_TAG_member
	.dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$89, DW_AT_name("ENPIE")
	.dwattr $C$DW$89, DW_AT_TI_symbol_name("_ENPIE")
	.dwattr $C$DW$89, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$89, DW_AT_bit_size(0x01)
	.dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$90	.dwtag  DW_TAG_member
	.dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$90, DW_AT_name("PIEVECT")
	.dwattr $C$DW$90, DW_AT_TI_symbol_name("_PIEVECT")
	.dwattr $C$DW$90, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$90, DW_AT_bit_size(0x0f)
	.dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$22


$C$DW$T$23	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
$C$DW$91	.dwtag  DW_TAG_member
	.dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$91, DW_AT_name("all")
	.dwattr $C$DW$91, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$92	.dwtag  DW_TAG_member
	.dwattr $C$DW$92, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$92, DW_AT_name("bit")
	.dwattr $C$DW$92, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$23


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_name("PIEIER_BITS")
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
$C$DW$93	.dwtag  DW_TAG_member
	.dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$93, DW_AT_name("INTx1")
	.dwattr $C$DW$93, DW_AT_TI_symbol_name("_INTx1")
	.dwattr $C$DW$93, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$93, DW_AT_bit_size(0x01)
	.dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$94	.dwtag  DW_TAG_member
	.dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$94, DW_AT_name("INTx2")
	.dwattr $C$DW$94, DW_AT_TI_symbol_name("_INTx2")
	.dwattr $C$DW$94, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$94, DW_AT_bit_size(0x01)
	.dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$95	.dwtag  DW_TAG_member
	.dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$95, DW_AT_name("INTx3")
	.dwattr $C$DW$95, DW_AT_TI_symbol_name("_INTx3")
	.dwattr $C$DW$95, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$95, DW_AT_bit_size(0x01)
	.dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$96	.dwtag  DW_TAG_member
	.dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$96, DW_AT_name("INTx4")
	.dwattr $C$DW$96, DW_AT_TI_symbol_name("_INTx4")
	.dwattr $C$DW$96, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$96, DW_AT_bit_size(0x01)
	.dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$97	.dwtag  DW_TAG_member
	.dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$97, DW_AT_name("INTx5")
	.dwattr $C$DW$97, DW_AT_TI_symbol_name("_INTx5")
	.dwattr $C$DW$97, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$97, DW_AT_bit_size(0x01)
	.dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$98	.dwtag  DW_TAG_member
	.dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$98, DW_AT_name("INTx6")
	.dwattr $C$DW$98, DW_AT_TI_symbol_name("_INTx6")
	.dwattr $C$DW$98, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$98, DW_AT_bit_size(0x01)
	.dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$99	.dwtag  DW_TAG_member
	.dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$99, DW_AT_name("INTx7")
	.dwattr $C$DW$99, DW_AT_TI_symbol_name("_INTx7")
	.dwattr $C$DW$99, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$99, DW_AT_bit_size(0x01)
	.dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$100	.dwtag  DW_TAG_member
	.dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$100, DW_AT_name("INTx8")
	.dwattr $C$DW$100, DW_AT_TI_symbol_name("_INTx8")
	.dwattr $C$DW$100, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$100, DW_AT_bit_size(0x01)
	.dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$101	.dwtag  DW_TAG_member
	.dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$101, DW_AT_name("rsvd")
	.dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd")
	.dwattr $C$DW$101, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$101, DW_AT_bit_size(0x08)
	.dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$24


$C$DW$T$25	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$25, DW_AT_name("PIEIER_REG")
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
$C$DW$102	.dwtag  DW_TAG_member
	.dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$102, DW_AT_name("all")
	.dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$103	.dwtag  DW_TAG_member
	.dwattr $C$DW$103, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$103, DW_AT_name("bit")
	.dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$25


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_name("PIEIFR_BITS")
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
$C$DW$104	.dwtag  DW_TAG_member
	.dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$104, DW_AT_name("INTx1")
	.dwattr $C$DW$104, DW_AT_TI_symbol_name("_INTx1")
	.dwattr $C$DW$104, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$104, DW_AT_bit_size(0x01)
	.dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$105	.dwtag  DW_TAG_member
	.dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$105, DW_AT_name("INTx2")
	.dwattr $C$DW$105, DW_AT_TI_symbol_name("_INTx2")
	.dwattr $C$DW$105, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$105, DW_AT_bit_size(0x01)
	.dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$106	.dwtag  DW_TAG_member
	.dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$106, DW_AT_name("INTx3")
	.dwattr $C$DW$106, DW_AT_TI_symbol_name("_INTx3")
	.dwattr $C$DW$106, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$106, DW_AT_bit_size(0x01)
	.dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$107	.dwtag  DW_TAG_member
	.dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$107, DW_AT_name("INTx4")
	.dwattr $C$DW$107, DW_AT_TI_symbol_name("_INTx4")
	.dwattr $C$DW$107, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$107, DW_AT_bit_size(0x01)
	.dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$108	.dwtag  DW_TAG_member
	.dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$108, DW_AT_name("INTx5")
	.dwattr $C$DW$108, DW_AT_TI_symbol_name("_INTx5")
	.dwattr $C$DW$108, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$108, DW_AT_bit_size(0x01)
	.dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$109	.dwtag  DW_TAG_member
	.dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$109, DW_AT_name("INTx6")
	.dwattr $C$DW$109, DW_AT_TI_symbol_name("_INTx6")
	.dwattr $C$DW$109, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$109, DW_AT_bit_size(0x01)
	.dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$110	.dwtag  DW_TAG_member
	.dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$110, DW_AT_name("INTx7")
	.dwattr $C$DW$110, DW_AT_TI_symbol_name("_INTx7")
	.dwattr $C$DW$110, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$110, DW_AT_bit_size(0x01)
	.dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$111	.dwtag  DW_TAG_member
	.dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$111, DW_AT_name("INTx8")
	.dwattr $C$DW$111, DW_AT_TI_symbol_name("_INTx8")
	.dwattr $C$DW$111, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$111, DW_AT_bit_size(0x01)
	.dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$112	.dwtag  DW_TAG_member
	.dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$112, DW_AT_name("rsvd")
	.dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd")
	.dwattr $C$DW$112, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$112, DW_AT_bit_size(0x08)
	.dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$26


$C$DW$T$27	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$27, DW_AT_name("PIEIFR_REG")
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
$C$DW$113	.dwtag  DW_TAG_member
	.dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$113, DW_AT_name("all")
	.dwattr $C$DW$113, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$114	.dwtag  DW_TAG_member
	.dwattr $C$DW$114, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$114, DW_AT_name("bit")
	.dwattr $C$DW$114, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$27


$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_name("PIE_CTRL_REGS")
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x1a)
$C$DW$115	.dwtag  DW_TAG_member
	.dwattr $C$DW$115, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$115, DW_AT_name("PIECRTL")
	.dwattr $C$DW$115, DW_AT_TI_symbol_name("_PIECRTL")
	.dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$116	.dwtag  DW_TAG_member
	.dwattr $C$DW$116, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$116, DW_AT_name("PIEACK")
	.dwattr $C$DW$116, DW_AT_TI_symbol_name("_PIEACK")
	.dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$117	.dwtag  DW_TAG_member
	.dwattr $C$DW$117, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$117, DW_AT_name("PIEIER1")
	.dwattr $C$DW$117, DW_AT_TI_symbol_name("_PIEIER1")
	.dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$118	.dwtag  DW_TAG_member
	.dwattr $C$DW$118, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$118, DW_AT_name("PIEIFR1")
	.dwattr $C$DW$118, DW_AT_TI_symbol_name("_PIEIFR1")
	.dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$119	.dwtag  DW_TAG_member
	.dwattr $C$DW$119, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$119, DW_AT_name("PIEIER2")
	.dwattr $C$DW$119, DW_AT_TI_symbol_name("_PIEIER2")
	.dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$120	.dwtag  DW_TAG_member
	.dwattr $C$DW$120, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$120, DW_AT_name("PIEIFR2")
	.dwattr $C$DW$120, DW_AT_TI_symbol_name("_PIEIFR2")
	.dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$121	.dwtag  DW_TAG_member
	.dwattr $C$DW$121, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$121, DW_AT_name("PIEIER3")
	.dwattr $C$DW$121, DW_AT_TI_symbol_name("_PIEIER3")
	.dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$122	.dwtag  DW_TAG_member
	.dwattr $C$DW$122, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$122, DW_AT_name("PIEIFR3")
	.dwattr $C$DW$122, DW_AT_TI_symbol_name("_PIEIFR3")
	.dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$123	.dwtag  DW_TAG_member
	.dwattr $C$DW$123, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$123, DW_AT_name("PIEIER4")
	.dwattr $C$DW$123, DW_AT_TI_symbol_name("_PIEIER4")
	.dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$124	.dwtag  DW_TAG_member
	.dwattr $C$DW$124, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$124, DW_AT_name("PIEIFR4")
	.dwattr $C$DW$124, DW_AT_TI_symbol_name("_PIEIFR4")
	.dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$125	.dwtag  DW_TAG_member
	.dwattr $C$DW$125, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$125, DW_AT_name("PIEIER5")
	.dwattr $C$DW$125, DW_AT_TI_symbol_name("_PIEIER5")
	.dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$126	.dwtag  DW_TAG_member
	.dwattr $C$DW$126, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$126, DW_AT_name("PIEIFR5")
	.dwattr $C$DW$126, DW_AT_TI_symbol_name("_PIEIFR5")
	.dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$127	.dwtag  DW_TAG_member
	.dwattr $C$DW$127, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$127, DW_AT_name("PIEIER6")
	.dwattr $C$DW$127, DW_AT_TI_symbol_name("_PIEIER6")
	.dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$128	.dwtag  DW_TAG_member
	.dwattr $C$DW$128, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$128, DW_AT_name("PIEIFR6")
	.dwattr $C$DW$128, DW_AT_TI_symbol_name("_PIEIFR6")
	.dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$129	.dwtag  DW_TAG_member
	.dwattr $C$DW$129, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$129, DW_AT_name("PIEIER7")
	.dwattr $C$DW$129, DW_AT_TI_symbol_name("_PIEIER7")
	.dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$130	.dwtag  DW_TAG_member
	.dwattr $C$DW$130, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$130, DW_AT_name("PIEIFR7")
	.dwattr $C$DW$130, DW_AT_TI_symbol_name("_PIEIFR7")
	.dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$131	.dwtag  DW_TAG_member
	.dwattr $C$DW$131, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$131, DW_AT_name("PIEIER8")
	.dwattr $C$DW$131, DW_AT_TI_symbol_name("_PIEIER8")
	.dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$132	.dwtag  DW_TAG_member
	.dwattr $C$DW$132, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$132, DW_AT_name("PIEIFR8")
	.dwattr $C$DW$132, DW_AT_TI_symbol_name("_PIEIFR8")
	.dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$133	.dwtag  DW_TAG_member
	.dwattr $C$DW$133, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$133, DW_AT_name("PIEIER9")
	.dwattr $C$DW$133, DW_AT_TI_symbol_name("_PIEIER9")
	.dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$134	.dwtag  DW_TAG_member
	.dwattr $C$DW$134, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$134, DW_AT_name("PIEIFR9")
	.dwattr $C$DW$134, DW_AT_TI_symbol_name("_PIEIFR9")
	.dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$135	.dwtag  DW_TAG_member
	.dwattr $C$DW$135, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$135, DW_AT_name("PIEIER10")
	.dwattr $C$DW$135, DW_AT_TI_symbol_name("_PIEIER10")
	.dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$136	.dwtag  DW_TAG_member
	.dwattr $C$DW$136, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$136, DW_AT_name("PIEIFR10")
	.dwattr $C$DW$136, DW_AT_TI_symbol_name("_PIEIFR10")
	.dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$137	.dwtag  DW_TAG_member
	.dwattr $C$DW$137, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$137, DW_AT_name("PIEIER11")
	.dwattr $C$DW$137, DW_AT_TI_symbol_name("_PIEIER11")
	.dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$138	.dwtag  DW_TAG_member
	.dwattr $C$DW$138, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$138, DW_AT_name("PIEIFR11")
	.dwattr $C$DW$138, DW_AT_TI_symbol_name("_PIEIFR11")
	.dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$139	.dwtag  DW_TAG_member
	.dwattr $C$DW$139, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$139, DW_AT_name("PIEIER12")
	.dwattr $C$DW$139, DW_AT_TI_symbol_name("_PIEIER12")
	.dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$140	.dwtag  DW_TAG_member
	.dwattr $C$DW$140, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$140, DW_AT_name("PIEIFR12")
	.dwattr $C$DW$140, DW_AT_TI_symbol_name("_PIEIFR12")
	.dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$28

$C$DW$141	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$141, DW_AT_type(*$C$DW$T$28)

$C$DW$T$33	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$141)


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_name("PIE_VECT_TABLE")
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x100)
$C$DW$142	.dwtag  DW_TAG_member
	.dwattr $C$DW$142, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$142, DW_AT_name("PIE1_RESERVED")
	.dwattr $C$DW$142, DW_AT_TI_symbol_name("_PIE1_RESERVED")
	.dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$143	.dwtag  DW_TAG_member
	.dwattr $C$DW$143, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$143, DW_AT_name("PIE2_RESERVED")
	.dwattr $C$DW$143, DW_AT_TI_symbol_name("_PIE2_RESERVED")
	.dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$144	.dwtag  DW_TAG_member
	.dwattr $C$DW$144, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$144, DW_AT_name("PIE3_RESERVED")
	.dwattr $C$DW$144, DW_AT_TI_symbol_name("_PIE3_RESERVED")
	.dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$145	.dwtag  DW_TAG_member
	.dwattr $C$DW$145, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$145, DW_AT_name("PIE4_RESERVED")
	.dwattr $C$DW$145, DW_AT_TI_symbol_name("_PIE4_RESERVED")
	.dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$146	.dwtag  DW_TAG_member
	.dwattr $C$DW$146, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$146, DW_AT_name("PIE5_RESERVED")
	.dwattr $C$DW$146, DW_AT_TI_symbol_name("_PIE5_RESERVED")
	.dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$147	.dwtag  DW_TAG_member
	.dwattr $C$DW$147, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$147, DW_AT_name("PIE6_RESERVED")
	.dwattr $C$DW$147, DW_AT_TI_symbol_name("_PIE6_RESERVED")
	.dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$148	.dwtag  DW_TAG_member
	.dwattr $C$DW$148, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$148, DW_AT_name("PIE7_RESERVED")
	.dwattr $C$DW$148, DW_AT_TI_symbol_name("_PIE7_RESERVED")
	.dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$149	.dwtag  DW_TAG_member
	.dwattr $C$DW$149, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$149, DW_AT_name("PIE8_RESERVED")
	.dwattr $C$DW$149, DW_AT_TI_symbol_name("_PIE8_RESERVED")
	.dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$150	.dwtag  DW_TAG_member
	.dwattr $C$DW$150, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$150, DW_AT_name("PIE9_RESERVED")
	.dwattr $C$DW$150, DW_AT_TI_symbol_name("_PIE9_RESERVED")
	.dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$151	.dwtag  DW_TAG_member
	.dwattr $C$DW$151, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$151, DW_AT_name("PIE10_RESERVED")
	.dwattr $C$DW$151, DW_AT_TI_symbol_name("_PIE10_RESERVED")
	.dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$152	.dwtag  DW_TAG_member
	.dwattr $C$DW$152, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$152, DW_AT_name("PIE11_RESERVED")
	.dwattr $C$DW$152, DW_AT_TI_symbol_name("_PIE11_RESERVED")
	.dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$153	.dwtag  DW_TAG_member
	.dwattr $C$DW$153, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$153, DW_AT_name("PIE12_RESERVED")
	.dwattr $C$DW$153, DW_AT_TI_symbol_name("_PIE12_RESERVED")
	.dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$154	.dwtag  DW_TAG_member
	.dwattr $C$DW$154, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$154, DW_AT_name("PIE13_RESERVED")
	.dwattr $C$DW$154, DW_AT_TI_symbol_name("_PIE13_RESERVED")
	.dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$155	.dwtag  DW_TAG_member
	.dwattr $C$DW$155, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$155, DW_AT_name("XINT13")
	.dwattr $C$DW$155, DW_AT_TI_symbol_name("_XINT13")
	.dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$156	.dwtag  DW_TAG_member
	.dwattr $C$DW$156, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$156, DW_AT_name("TINT2")
	.dwattr $C$DW$156, DW_AT_TI_symbol_name("_TINT2")
	.dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$157	.dwtag  DW_TAG_member
	.dwattr $C$DW$157, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$157, DW_AT_name("DATALOG")
	.dwattr $C$DW$157, DW_AT_TI_symbol_name("_DATALOG")
	.dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$158	.dwtag  DW_TAG_member
	.dwattr $C$DW$158, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$158, DW_AT_name("RTOSINT")
	.dwattr $C$DW$158, DW_AT_TI_symbol_name("_RTOSINT")
	.dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$159	.dwtag  DW_TAG_member
	.dwattr $C$DW$159, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$159, DW_AT_name("EMUINT")
	.dwattr $C$DW$159, DW_AT_TI_symbol_name("_EMUINT")
	.dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$160	.dwtag  DW_TAG_member
	.dwattr $C$DW$160, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$160, DW_AT_name("XNMI")
	.dwattr $C$DW$160, DW_AT_TI_symbol_name("_XNMI")
	.dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$161	.dwtag  DW_TAG_member
	.dwattr $C$DW$161, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$161, DW_AT_name("ILLEGAL")
	.dwattr $C$DW$161, DW_AT_TI_symbol_name("_ILLEGAL")
	.dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$162	.dwtag  DW_TAG_member
	.dwattr $C$DW$162, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$162, DW_AT_name("USER1")
	.dwattr $C$DW$162, DW_AT_TI_symbol_name("_USER1")
	.dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$163	.dwtag  DW_TAG_member
	.dwattr $C$DW$163, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$163, DW_AT_name("USER2")
	.dwattr $C$DW$163, DW_AT_TI_symbol_name("_USER2")
	.dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$164	.dwtag  DW_TAG_member
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$164, DW_AT_name("USER3")
	.dwattr $C$DW$164, DW_AT_TI_symbol_name("_USER3")
	.dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$165	.dwtag  DW_TAG_member
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$165, DW_AT_name("USER4")
	.dwattr $C$DW$165, DW_AT_TI_symbol_name("_USER4")
	.dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$166, DW_AT_name("USER5")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("_USER5")
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$167, DW_AT_name("USER6")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("_USER6")
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$168, DW_AT_name("USER7")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("_USER7")
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$169, DW_AT_name("USER8")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("_USER8")
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$170, DW_AT_name("USER9")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("_USER9")
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$171, DW_AT_name("USER10")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("_USER10")
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$172, DW_AT_name("USER11")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("_USER11")
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$173, DW_AT_name("USER12")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("_USER12")
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$174, DW_AT_name("PDPINTA")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("_PDPINTA")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$175, DW_AT_name("PDPINTB")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("_PDPINTB")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$176, DW_AT_name("rsvd1_3")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd1_3")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$177, DW_AT_name("XINT1")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("_XINT1")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$178, DW_AT_name("XINT2")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("_XINT2")
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$179, DW_AT_name("ADCINT")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("_ADCINT")
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$180, DW_AT_name("TINT0")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("_TINT0")
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$181, DW_AT_name("WAKEINT")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("_WAKEINT")
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$182, DW_AT_name("CMP1INT")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("_CMP1INT")
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$183, DW_AT_name("CMP2INT")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("_CMP2INT")
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$184, DW_AT_name("CMP3INT")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("_CMP3INT")
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$185, DW_AT_name("T1PINT")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("_T1PINT")
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$186, DW_AT_name("T1CINT")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("_T1CINT")
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$187, DW_AT_name("T1UFINT")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("_T1UFINT")
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$188, DW_AT_name("T1OFINT")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("_T1OFINT")
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$189, DW_AT_name("rsvd2_8")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("_rsvd2_8")
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$190, DW_AT_name("T2PINT")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("_T2PINT")
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$191, DW_AT_name("T2CINT")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("_T2CINT")
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$192, DW_AT_name("T2UFINT")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("_T2UFINT")
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$193, DW_AT_name("T2OFINT")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("_T2OFINT")
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$194, DW_AT_name("CAPINT1")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("_CAPINT1")
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$195, DW_AT_name("CAPINT2")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("_CAPINT2")
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$196, DW_AT_name("CAPINT3")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("_CAPINT3")
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$197, DW_AT_name("rsvd3_8")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("_rsvd3_8")
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$198, DW_AT_name("CMP4INT")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("_CMP4INT")
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$199, DW_AT_name("CMP5INT")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("_CMP5INT")
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$200, DW_AT_name("CMP6INT")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("_CMP6INT")
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$201, DW_AT_name("T3PINT")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("_T3PINT")
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$202, DW_AT_name("T3CINT")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("_T3CINT")
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$203, DW_AT_name("T3UFINT")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("_T3UFINT")
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$204, DW_AT_name("T3OFINT")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("_T3OFINT")
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$205, DW_AT_name("rsvd4_8")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd4_8")
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$206, DW_AT_name("T4PINT")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("_T4PINT")
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$207, DW_AT_name("T4CINT")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("_T4CINT")
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$208, DW_AT_name("T4UFINT")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("_T4UFINT")
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$209, DW_AT_name("T4OFINT")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("_T4OFINT")
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$210, DW_AT_name("CAPINT4")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("_CAPINT4")
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$211	.dwtag  DW_TAG_member
	.dwattr $C$DW$211, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$211, DW_AT_name("CAPINT5")
	.dwattr $C$DW$211, DW_AT_TI_symbol_name("_CAPINT5")
	.dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$212	.dwtag  DW_TAG_member
	.dwattr $C$DW$212, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$212, DW_AT_name("CAPINT6")
	.dwattr $C$DW$212, DW_AT_TI_symbol_name("_CAPINT6")
	.dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$213	.dwtag  DW_TAG_member
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$213, DW_AT_name("rsvd5_8")
	.dwattr $C$DW$213, DW_AT_TI_symbol_name("_rsvd5_8")
	.dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
	.dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$214	.dwtag  DW_TAG_member
	.dwattr $C$DW$214, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$214, DW_AT_name("SPIRXINTA")
	.dwattr $C$DW$214, DW_AT_TI_symbol_name("_SPIRXINTA")
	.dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$215	.dwtag  DW_TAG_member
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$215, DW_AT_name("SPITXINTA")
	.dwattr $C$DW$215, DW_AT_TI_symbol_name("_SPITXINTA")
	.dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
	.dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$216, DW_AT_name("rsvd6_3")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("_rsvd6_3")
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$217, DW_AT_name("rsvd6_4")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("_rsvd6_4")
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$218, DW_AT_name("MRINTA")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("_MRINTA")
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$219, DW_AT_name("MXINTA")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("_MXINTA")
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$220, DW_AT_name("rsvd6_7")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("_rsvd6_7")
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$221, DW_AT_name("rsvd6_8")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("_rsvd6_8")
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$222, DW_AT_name("rsvd7_1")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("_rsvd7_1")
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$223, DW_AT_name("rsvd7_2")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("_rsvd7_2")
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$224, DW_AT_name("rsvd7_3")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("_rsvd7_3")
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$225, DW_AT_name("rsvd7_4")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("_rsvd7_4")
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$226, DW_AT_name("rsvd7_5")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("_rsvd7_5")
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$227	.dwtag  DW_TAG_member
	.dwattr $C$DW$227, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$227, DW_AT_name("rsvd7_6")
	.dwattr $C$DW$227, DW_AT_TI_symbol_name("_rsvd7_6")
	.dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
	.dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$228	.dwtag  DW_TAG_member
	.dwattr $C$DW$228, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$228, DW_AT_name("rsvd7_7")
	.dwattr $C$DW$228, DW_AT_TI_symbol_name("_rsvd7_7")
	.dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
	.dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$229	.dwtag  DW_TAG_member
	.dwattr $C$DW$229, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$229, DW_AT_name("rsvd7_8")
	.dwattr $C$DW$229, DW_AT_TI_symbol_name("_rsvd7_8")
	.dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
	.dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$230	.dwtag  DW_TAG_member
	.dwattr $C$DW$230, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$230, DW_AT_name("rsvd8_1")
	.dwattr $C$DW$230, DW_AT_TI_symbol_name("_rsvd8_1")
	.dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$231, DW_AT_name("rsvd8_2")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("_rsvd8_2")
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$232, DW_AT_name("rsvd8_3")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("_rsvd8_3")
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$233	.dwtag  DW_TAG_member
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$233, DW_AT_name("rsvd8_4")
	.dwattr $C$DW$233, DW_AT_TI_symbol_name("_rsvd8_4")
	.dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
	.dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$234	.dwtag  DW_TAG_member
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$234, DW_AT_name("rsvd8_5")
	.dwattr $C$DW$234, DW_AT_TI_symbol_name("_rsvd8_5")
	.dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
	.dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$235, DW_AT_name("rsvd8_6")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("_rsvd8_6")
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$236, DW_AT_name("rsvd8_7")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("_rsvd8_7")
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$237, DW_AT_name("rsvd8_8")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("_rsvd8_8")
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$238, DW_AT_name("RXAINT")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("_RXAINT")
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$239, DW_AT_name("TXAINT")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("_TXAINT")
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$240, DW_AT_name("RXBINT")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("_RXBINT")
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$241, DW_AT_name("TXBINT")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("_TXBINT")
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$242, DW_AT_name("ECAN0INTA")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("_ECAN0INTA")
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$243, DW_AT_name("ECAN1INTA")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("_ECAN1INTA")
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$244, DW_AT_name("rsvd9_7")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("_rsvd9_7")
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$245, DW_AT_name("rsvd9_8")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("_rsvd9_8")
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$246, DW_AT_name("rsvd10_1")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("_rsvd10_1")
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$247, DW_AT_name("rsvd10_2")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("_rsvd10_2")
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$248, DW_AT_name("rsvd10_3")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("_rsvd10_3")
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$249, DW_AT_name("rsvd10_4")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("_rsvd10_4")
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$250, DW_AT_name("rsvd10_5")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("_rsvd10_5")
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$251, DW_AT_name("rsvd10_6")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("_rsvd10_6")
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$252, DW_AT_name("rsvd10_7")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("_rsvd10_7")
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$253, DW_AT_name("rsvd10_8")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("_rsvd10_8")
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$254, DW_AT_name("rsvd11_1")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("_rsvd11_1")
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$255, DW_AT_name("rsvd11_2")
	.dwattr $C$DW$255, DW_AT_TI_symbol_name("_rsvd11_2")
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$256, DW_AT_name("rsvd11_3")
	.dwattr $C$DW$256, DW_AT_TI_symbol_name("_rsvd11_3")
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$257	.dwtag  DW_TAG_member
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$257, DW_AT_name("rsvd11_4")
	.dwattr $C$DW$257, DW_AT_TI_symbol_name("_rsvd11_4")
	.dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
	.dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$258	.dwtag  DW_TAG_member
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$258, DW_AT_name("rsvd11_5")
	.dwattr $C$DW$258, DW_AT_TI_symbol_name("_rsvd11_5")
	.dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$259, DW_AT_name("rsvd11_6")
	.dwattr $C$DW$259, DW_AT_TI_symbol_name("_rsvd11_6")
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$260	.dwtag  DW_TAG_member
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$260, DW_AT_name("rsvd11_7")
	.dwattr $C$DW$260, DW_AT_TI_symbol_name("_rsvd11_7")
	.dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
	.dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$261, DW_AT_name("rsvd11_8")
	.dwattr $C$DW$261, DW_AT_TI_symbol_name("_rsvd11_8")
	.dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$262, DW_AT_name("rsvd12_1")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("_rsvd12_1")
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$263, DW_AT_name("rsvd12_2")
	.dwattr $C$DW$263, DW_AT_TI_symbol_name("_rsvd12_2")
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
	.dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$264	.dwtag  DW_TAG_member
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$264, DW_AT_name("rsvd12_3")
	.dwattr $C$DW$264, DW_AT_TI_symbol_name("_rsvd12_3")
	.dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$265	.dwtag  DW_TAG_member
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$265, DW_AT_name("rsvd12_4")
	.dwattr $C$DW$265, DW_AT_TI_symbol_name("_rsvd12_4")
	.dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
	.dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$266, DW_AT_name("rsvd12_5")
	.dwattr $C$DW$266, DW_AT_TI_symbol_name("_rsvd12_5")
	.dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$267	.dwtag  DW_TAG_member
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$267, DW_AT_name("rsvd12_6")
	.dwattr $C$DW$267, DW_AT_TI_symbol_name("_rsvd12_6")
	.dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
	.dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$268	.dwtag  DW_TAG_member
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$268, DW_AT_name("rsvd12_7")
	.dwattr $C$DW$268, DW_AT_TI_symbol_name("_rsvd12_7")
	.dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
	.dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$269, DW_AT_name("rsvd12_8")
	.dwattr $C$DW$269, DW_AT_TI_symbol_name("_rsvd12_8")
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$32

$C$DW$270	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$32)

$C$DW$T$35	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$270)

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")


$C$DW$T$29	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
	.dwendtag $C$DW$T$29

$C$DW$T$30	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$30, DW_AT_address_class(0x20)

$C$DW$T$31	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$31, DW_AT_name("PINT")
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)

$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)

$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)

$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)

$C$DW$T$38	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$38, DW_AT_name("int16")
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)

$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)

$C$DW$T$19	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$19, DW_AT_name("Uint16")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)

$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x02)

$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)

$C$DW$T$41	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$41, DW_AT_name("Uint32")
	.dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)

$C$DW$T$42	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$42, DW_AT_address_class(0x20)

$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)

$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)

$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)

$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)

$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
